SnakesAndLadders/README.md
```mermaid
classDiagram
direction TB

class Game {
  - board: Board
  - players: List<Player>
  - dice: Dice
  - status: GameStatus
  + play(): void
}

class Dice {
  - minValue: int
  - maxValue: int
  + roll(): int
}

class Board {
  - size: int
  - snakesAndLadders: Map
  + applyTransitions(position: int): int
}

class Player {
  - name: String
  - position: int
}

class GameStatus {
  NOT_STARTED
  RUNNING
  FINISHED
}

class BoardEntity {
  - start: int
  - end: int
}

class Snake
class Ladder

Game *-- Board
Game *-- Player
Dice --> Game : manages
Game --> GameStatus : status

Board o-- "0..*" BoardEntity : stores

BoardEntity <|-- Snake : start > end
BoardEntity <|-- Ladder : start < end
```
